In [1]:
import pandas as pd
import numpy as np

In [4]:
from Unemployment import unemp
from Suicide import suic

ModuleNotFoundError: No module named 'Unemployment'

In [8]:
x = pd.merge(suic, unemp, on="country")

In [9]:
x

,year_x,gender_x,age_x,suicides_no,population,suic_rate_100k,gender_y,age_y,year_y,unemploy_rate
country,,,,,,,,,,
Australia,2000,female,15-24 years,78.0,1285283.0,6.068702,MW,15 to 19,2000,49.215684
Australia,2000,female,15-24 years,78.0,1285283.0,6.068702,MW,15 to 19,2001,49.416769
Australia,2000,female,15-24 years,78.0,1285283.0,6.068702,MW,15 to 19,2002,49.012172
Australia,2000,female,15-24 years,78.0,1285283.0,6.068702,MW,15 to 19,2003,49.897541
Australia,2000,female,15-24 years,78.0,1285283.0,6.068702,MW,15 to 19,2004,50.394122
...,...,...,...,...,...,...,...,...,...,...
United Kingdom,2016,male,75+ years,NaN,2235650.0,NaN,WOMEN,Total,2015,5.105224
United Kingdom,2016,male,75+ years,NaN,2235650.0,NaN,WOMEN,Total,2016,4.742915
United Kingdom,2016,male,75+ years,NaN,2235650.0,NaN,WOMEN,Total,2017,4.210591
United Kingdom,2016,male,75+ years,NaN,2235650.0,NaN,WOMEN,Total,2018,4.097872
United Kingdom,2016,male,75+ years,NaN,2235650.0,NaN,WOMEN,Total,2019,3.635548